app/views/hitters/index.html.haml


="Hitter Count: #{Hitter.count}"
---
SELECT COUNT(*) FROM "hitters"