app/views/players/index.html.haml


="Player Count: #{Player.count}"
---
SELECT COUNT(*) FROM "players"