app/controllers/hitters_controller.rb

	def index
		#Hitter.order("lname")
		@hitters = Hitter.all
---
SELECT "hitters".* FROM "hitters"

	def create
		@hitter = Hitter.new(params[:hitter])
		if @hitter.save
---
INSERT INTO "hitters" ("ab", "created_at", "cs", "dbl", "g", "h", "hr", "player_id", "r", "rbi", "sb", "trp", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

	def update
		#@hitter = Hitter.find(params[:id])
		if @hitter.update_attributes(params[:hitter])
---
UPDATE "hitters" SET "r" = 1, "rbi" = 1, "sb" = 1, "cs" = 1, "updated_at" = '2012-05-28 23:02:55.467761' WHERE "hitters"."id" = 1

	def destroy
		#@player = Player.find(params[:id])
		@hitter.destroy
---
DELETE FROM "hitters" WHERE "hitters"."id" = $1  [["id", 2]]