app/controllers/players_controller.rb

	def index
		#Player.order("lname")
		@players = Player.all
---
SELECT "players".* FROM "players"

	def show
		@player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]

	def edit
		@player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]

	def create
		@player = Player.new(params[:player])
		if @player.save
---
INSERT INTO "players" ("atbats", "created_at", "fname", "hits", "league", "lname", "rbi", "runs", "team", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

	def update
		@player = Player.find(params[:id])
		if @player.update_attributes(params[:player])
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "players" SET "team" = 'Det', "league" = 'AL', "atbats" = 550, "hits" = 210, "runs" = 107, "rbi" = 112, "updated_at" = '2012-05-14 03:57:28.880808' WHERE "players"."id" = 7

	def destroy
		@player = Player.find(params[:id])
		@player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 1]]